🚀&nbsp; env0 had composed a PR Plan for environment [aws-demo-sandbox-24239](https://app.env0.com/p/46205c18-6307-415f-adc7-f3f6c27f18d4/environments/b15e3646-0d4e-4d7a-ad22-4d9a5013fb7a):
```
Plan: 2 to add, 0 to change, 0 to destroy.
```

<details>

<summary>Plan Details</summary>

```

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:


  # module.ec2_instances.module.ec2_instances.aws_instance.app[1] will be created
  + resource "aws_instance" "app" {
      + ami                                  = "ami-0ab4d1e9cf9a1215a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-071fb6c55674d2b80"
      + tags                                 = {
          + "environment" = "sandbox"
          + "owner"       = "smsilva@gmail.com"
          + "project"     = "demo"
          + "version"     = "2.0.1"
        }
      + tags_all                             = {
          + "environment" = "sandbox"
          + "owner"       = "smsilva@gmail.com"
          + "project"     = "demo"
          + "version"     = "2.0.1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "3b21b980468438c9034158841596d57f1283de5c"
      + vpc_security_group_ids               = [
          + "sg-04b8b7588e611e4f5",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }


  # module.ec2_instances.module.elb_http.module.elb_attachment.aws_elb_attachment.this[1] will be created
  + resource "aws_elb_attachment" "this" {
      + elb      = "demo-peGWW-us-east-1-lb"
      + id       = (known after apply)
      + instance = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```
</details>

  ```
Monthly cost change for smsilva/terraform-demo-live/src/.tf-plan
Amount:  +$5.03 ($56.13 -> $61.17)
Percent: +9%
```

<details>

<summary>Cost Estimation Details</summary>

```
Project: smsilva/terraform-demo-live/src/.tf-plan

+ module.ec2_instances.module.ec2_instances.aws_instance.app[1]
  +$5.03

    + Instance usage (Linux/UNIX, on-demand, t2.nano)
      +$4.23

    + root_block_device
    
        + Storage (general purpose SSD, gp2)
          +$0.80

Monthly cost change for smsilva/terraform-demo-live/src/.tf-plan
Amount:  +$5.03 ($56.13 -> $61.17)
Percent: +9%

----------------------------------
Key: ~ changed, + added, - removed
```
</details>

  
[Full Plan Logs on env0](https://app.env0.com/p/46205c18-6307-415f-adc7-f3f6c27f18d4/environments/b15e3646-0d4e-4d7a-ad22-4d9a5013fb7a/deployments/90384548-8c9e-49ab-97c8-b281dbffcb85)